import { HttpClient } from '@angular/common/http';
import { Component, OnInit } from '@angular/core';
import { NgForm } from '@angular/forms';
import { Router } from '@angular/router';
import { Email } from 'src/Models/Email';
import { MailService } from '../mail.service';

@Component({
  selector: 'app-main',
  templateUrl: './main.component.html',
  styleUrls: ['./main.component.css']
})
export class MainComponent implements OnInit {
  flag:number;
  flag1:number;
  pageList:string[]=["ב", ":ב", ".ג", ":ג", ".ד", ":ד", ".ה", ":ה", ".ו", ":ו", ".ז", ":ז", ".ח", ":ח", ".ט", ":ט", ".י", ":י",".יא",":יא",".יב",":יב",".יג",":יג",".יד",":יד",".טו",":טו",".טז",":טז",".יז",":יז",".יח",":יח",".יט",":יט",".כ",":כ",".כא",":כא",".כב",":כב",".כג",":כג",".כד",":כד",".כה",":כה",".כו",":כו",".כז",":כז",".כח",":כח",".כט",":כט",".ל",":ל",".לא",":לא",".לב",":לב",".לג",":לג",".לד",":לד",".לה",":לה",".לו",":לו",".לז",":לז",".לח",":לח",".לט",":לט",".מ",":מ",".מא",":מא",".מב",":מב",".מג",":מג",".מד",":מד",".מה",":מה",".מו",":מו",".מז",":מז",".מח",":מח",".מט",":מט",".נ",":נ",".נא",":נא",".נב",":נב",".נג",":נג",".נד",":נד",".נה",":נה",".נו",":נו",".נז",":נז",".נח",":נח",".נט",":נט",".ס",":ס",".סא",":סא",".סב",":סב",".סג",":סג",".סד",":סד",".סה",":סה",".סו",":סו",".סז",":סז",".סח",":סח",".סט",":סט",".ע",":ע",".עא",":עא",".עב",":עב",".עג",":עג",".עד",":עד",".עה",":עה",".עו",":עו",".עז",":עז",".עח",":עח",".עט",":עט",".פ",":פ",".פא",":פא",".פב",":פב",".פג",":פג",".פד",":פד",".פה",":פה",".פו",":פו",".פז",":פז",".פח",":פח",".פט",":פט",".צ",":צ",".צא",":צא",".צב",":צב",".צג",":צג",".צד",":צד",".צה",":צה",".צו",":צו",".צז",":צז",".צח",":צח",".צט",":צט",".ק",":ק",".קא",":קא",".קב",":קב",".קג",":קג",".קד",":קד",".קה",":קה",".קו",":קו",".קז",":קז",".קח",":קח",".קט",":קט",".קי", ":קי",".קיא",":קיא",".קיב",":קיב",".קיג",":קיג",".קיד",":קיד",".קטו",":קטו",".קטז",":קטז",".קיז",":קיז",".קיח",":קיח",".קיט",":קיט",".קכ",
 ":קכ",".קכא",":קכא",".קכב",":קכב",".קכג",":קכג",".קכד",":קכד",".קכה",":קכה",".קכו",":קכו",".קכז",":קכז",".קכח",":קכח",".קכט",":קכט",".קל",":קל",".קלא",":קלא",".קלב",":קלב",".קלג",":קלג",".קלד",":קלד",".קלה",":קלה",".קלו",":קלו",".קלז",":קלז",".קלח",":קלח",".קלט",":קלט",".קמ",":קמ",".קמא",":קמא",".קמב",":קמב",".קמג",":קמג",".קמד",":קמד",".קמה",":קמה",".קמו",":קמו",".קמז",":קמז",".קמח",":קמח",".קמט",":קמט",".קנ",":קנ",".קנא",":קנא",".קנב",":קנב",".קנג",":קנג",".קנד",":קנד",".קנה",":קנה",".קנו",":קנו",".קנז",":קנז",".קנח",":קנח",".קנט",":קנט",".קס",":קס",".קסא",":קסא",".קסב",":קסב",".קסג",":קסג",".קסד",":קסד",".קסה",":קסה",".קסו",":קסו",".קסז",":קסז",".קסח",":קסח",".קסט",":קסט",".קע",":קע",,".קעא",":קעא",".קעב",":קעב",".קעג",":קעג",".קעד",":קעד",".קעה",":קעה",".קעו",":קעו",".קעז",":קעז",]
simenList:string[]=["א","ב","ג","ד","ה","ו","ז","ח","ט","י","יא","יב","יג","יד","טו","טז","יז","יח","יט","כ","כא","כב","כג","כד","כה","כו","כז","כח","כט","ל","לא","לב","לג","לד","לה","לו","לז","לח","לט","מ","מא","מב","מג","מד","מה","מו","מז","מח","מט","נ","נא","נב","נג","נד","נה","נו","נז","נח","נט",
"ס","סא","סב","סג","סד","סה","סו","סז","סח","סט","ע","עא","עב","עג","עד","עה","עו","עז","עח","עט","פ","פא","פב","פג","פד","פה","פו","פז","פח","פט","צ","צא","צב","צג","צד","צה","צו","צז","צח","צט","ק","קא","קב","קג","קד","קה","קו","קז","קח","קט","קי","קיא","קיב",
"קיג","קיד","קטו","קטז","קיז","קיח","קיט","קכ","קכא","קכב","קכג","קכד","קכה","קכו","קכז","קכח","קכט","קל","קלא","קלב","קלג","קלד","קלה","קלו","קלז","קלח","קלט","קמ","קמא","קמב","קמג","קמד","קמה","קמו","קמז","קמח","קמט","קנ","קנא","קנב","קנג","קנד","קנה","קנו","קנז","קנח","קנט","קס",
"קסא","קסב","קסג","קסד","קסה","קסו","קסז","קסח","קסט","קע","קעא","קעב","קעג","קעד","קעה","קעו","קעז","קעח","קעט","קפ","קפא","קפב","קפג","קפד","קפה","קפו","קפז","קפח","קפט","קצ","קצא","קצב","קצג","קצד","קצה","קצו","קצז","קצח","קצט","ר","רא","רב","רג","רד","רה","רו","רז","רח","רט",
"רי","ריא","ריב","ריג","ריד","רטו","רטז","ריז","ריח","ריט","רכ","רכא","רכב","רכג","רכד","רכה","רכו","רכז","רכח","רכט","רל","רלא","רלב","רלג","רלד","רלה","רלו","רלז","רלח","רלט","רמ","רמא","רמב","רמג","רמד","רמה","רמו","רמז","רמח","רמט","רנ","רנא","רנב","רנג","רנד","רנה","רנו",
"רנז","רנח","רנט","רס","רסא","רסב","רסג","רסד","רסה","רסו","רסז","רסח","רסט","רע","רעא","רעב","רעג","רעד","רעה","רעו","רעז","רעח","רעט","רפ","רפא","רפב","רפג","רפד","רפה","רפו","רפז","רפח","רפט","רצ","רצא","רצב","רצג","רצד","רצה","רצו","רצז","רצח","רצט","ש","שא","שב","שג","שד",
"שה","שו","שז","שח","שט","שי","שיא","שיב","שיג","שיד","שטו","שטז","שיז","שיח","שיט","שכ","שכא","שכב","שכג","שכד","שכה","שכו","שכז","שכח","שכט","של","שלא","שלב","שלג","שלד","שלה","שלו","שלז","שלח","שלט","שמ","שמא","שמב","שמג","שמד","שמה","שמו","שמז","שמח","שמט","שנ","שנא","שנב",
"שנג","שנד","שנה","שנו","שנז","שנח","שנט","שס","שסא","שסב","שסג","שסד","שסה","שסו","שסז","שסח","שסט","שע","שעא","שעב","שעג","שעד","שעה","שעו","שעז","שעח","שעט","שפ","שפא","שפב","שפג","שפד","שפה","שפו","שפז","שפח","שפט","שצ","שצא","שצב","שצג","שצד","שצה","שצו","שצז","שצח","שצט",
"ת","תא","תב","תג","תד","תה","תו","תז","תח","תט","תי","תיא","תיב","תיג","תיד","תטו","תטז","תיז","תיח","תיט","תכ","תכא","תכב","תכג","תכד","תכה","תכו","תכז","תכח","תכט","תל","תלא","תלב","תלג","תלד","תלה","תלו","תלז","תלח","תלט","תמ","תמא","תמב",
"תמג","תמד","תמה","תמו","תמז","תמח","תמט","תנ","תנא","תנב","תנג","תנד","תנה","תנו","תנז","תנח","תנט","תס","תסא","תסב","תסג","תסד","תסה","תסו","תסז","תסח","תסט","תע","תעא","תעב","תעג","תעד","תעה","תעו","תעז","תעח","תעט","תפ","תפא","תפב","תפג","תפד","תפה","תפו","תפז","תפח","תפט","תצ",
"תצא","תצב","תצג","תצד","תצה","תצו","תצז","תצח","תצט","תק","תקא","תקב","תקג","תקד","תקה","תקו","תקז","תקח","תקט","תקי","תקיא","תקיב","תקיג","תקיד","תקטו","תקטז","תקיז","תקיח","תקיט","תקכ","תקכא","תקכב","תקכג","תקכד","תקכה","תקכו","תקכז","תקכח","תקכט","תקל","תקלא","תקלב","תקלג","תקלד",
"תקלה","תקלו","תקלז","תקלח","תקלט","תקמ","תקמא","תקמב","תקמג","תקמד","תקמה","תקמו","תקמז","תקמח","תקמט","תקנ","תקנא","תקנב","תקנג","תקנד","תקנה","תקנו","תקנז","תקנח","תקנט","תקס","תקסא","תקסב","תקסג","תקסד","תקסה","תקסו","תקסז","תקסח","תקסט","תקע","תקעא","תקעב","תקעג","תקעד","תקעה",
"תקעו","תקעז","תקעח","תקעט","תקפ","תקפא","תקפב","תקפג","תקפד","תקפה","תקפו","תקפז","תקפח","תקפט","תקצ","תקצא","תקצב","תקצג","תקצד","תקצה","תקצו","תקצז","תקצח","תקצט","תר","תרא","תרב","תרג","תרד","תרה","תרו","תרז","תרח","תרט","תרי","תריא","תריב","תריג","תריד","תרטו","תרטז","תריז",
"תריח","תריט","תרכ","תרכא","תרכב","תרכג","תרכד","תרכה","תרכו","תרכז","תרכח","תרכט","תרל","תרלא","תרלב","תרלג","תרלד","תרלה","תרלו","תרלז","תרלח","תרלט","תרמ","תרמא","תרמב","תרמג","תרמד","תרמה","תרמו","תרמז","תרמח","תרמט","תרנ","תרנא","תרנב","תרנג","תרנד","תרנה","תרנו","תרנז",
"תרנח","תרנט","תרס","תרסא","תרסב","תרסג","תרסד","תרסה","תרסו","תרסז","תרסח","תרסט","תרע","תרעא","תרעב","תרעג","תרעד","תרעה","תרעו","תרעז","תרעח","תרעט","תרפ","תרפא","תרפב","תרפג","תרפד","תרפה","תרפו","תרפז","תרפח","תרפט","תרצ","תרצא","תרצב","תרצג","תרצד","תרצה","תרצו","תרצז"];
 constructor(private mailService:MailService,private router: Router) { }
 ngOnInit() {
 }
 MasectesSelect(num)
  {
      this.flag=num;
  }
PageSelect(page:any)
  {
    this.router.navigate(['/question']);
  }
  SimenSelect(num)
  {
    this.flag1=num;

  }
}
